In [1]:
import numpy as np
import pandas as pd
from fuzzywuzzy import fuzz

In [20]:
roads = pd.read_csv('Railroads.csv')
dests = pd.read_csv('destinations.csv')

In [21]:
roads.head()

        from        to  length color
0  Vancouver   Calgary       3  gray
1  Vancouver   Seattle       1  gray
2  Vancouver   Seattle       1  gray
3    Seattle  Portland       1  gray
4    Seattle  Portland       1  gray

In [22]:
dests.head()

      from              to  points
0   Boston           Miami      12
1  Calgary         Phoenix      13
2  Calgary  Salt Lake City       7
3  Chicago     New Orleans       7
4  Chicago        Santa Fe       9

In [23]:
# merege df columns from and to
def merge_unique_from_to(df):
    return np.concatenate((df['from'].values,df['to'].values))

# find distinct  in each of them, make sure there are no typos
def show_most_simelar_strings(container):
    droped_duplicates = tuple(set(container))
    results=[]
    for index,string_a in enumerate(droped_duplicates):
        for string_b in droped_duplicates[index+1:]:
            compere = (string_a,string_b,fuzz.ratio(string_a,string_b))
            results.append(compere)
    return sorted(results,key= lambda x: x[2],reverse=True)

In [6]:
for dataset in(roads,dests):
    all_city_names = merge_unique_from_to(dataset)
    most_simelar = show_most_simelar_strings(all_city_names)
    print(most_simelar[:10])

[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Saint Louis', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52)]
[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52), ('Sault St. Marie', 'Salt Lake City', 48)]

In [7]:
def capitlize_all_words_after_space(df):
    cols = set(df.columns)
    for column in ('from','to'):
        if column in cols:
            df[column] = df[column].str.title().str.strip()
    return df

In [8]:
def text_pipeline(df):
    df = df.copy()
    capitlize_all_words_after_space(df)
    return df

In [9]:
roads1 = text_pipeline(roads)
dests1 = text_pipeline(dests)
for dataset in(roads1,dests1):
    all_city_names = merge_unique_from_to(dataset)
    most_simelar = show_most_simelar_strings(all_city_names)
    print(most_simelar[:10])

[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Saint Louis', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52)]
[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52), ('Sault St. Marie', 'Salt Lake City', 48)]

In [10]:
def merge_2df(df1,df2):
    return np.concatenate((df1['from'].values,df1['to'].values,df2['from'].values,df2['to'].values))

In [11]:
all_city_names = merge_2df(roads1,dests1)
most_simelar = show_most_simelar_strings(all_city_names)
print(most_simelar[:10])

[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Saint Louis', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52)]

In [12]:
def fix_spelling_errors(df):
    cols = set(df.columns)
    for column in ('from','to'):
        df[column] = df[column].str.replace('Oklahima','Oklahoma',regex=False)
    return df

def text_pipeline(df):
    df = df.copy()
    df = capitlize_all_words_after_space(df)
    df = fix_spelling_errors(df)
    return df

In [13]:
roads2 = text_pipeline(roads)
dests2 = text_pipeline(dests)
all_city_names = merge_2df(roads2,dests2)
most_simelar = show_most_simelar_strings(all_city_names)
print(most_simelar[:10])

[('Houston', 'Boston', 77), ('Oklahoma City', 'Kansas City', 58), ('Kansas City', 'Salt Lake City', 56), ('Seattle', 'Santa Fe', 53), ('Portland', 'Atlanta', 53), ('Denver', 'Vancouver', 53), ('New Orleans', 'New York', 53), ('Atlanta', 'Santa Fe', 53), ('Saint Louis', 'Santa Fe', 53), ('Oklahoma City', 'Salt Lake City', 52)]

In [14]:
text_pipeline(roads)

    Unnamed: 0       from        to  length   color
0            0  Vancouver   Calgary       3    gray
1            1  Vancouver   Seattle       1    gray
2            2  Vancouver   Seattle       1    gray
3            3    Seattle  Portland       1    gray
4            4    Seattle  Portland       1    gray
..         ...        ...       ...     ...     ...
88          88   Montreal    Boston       2    gray
89          89   Montreal    Boston       2    gray
90          90   New York    Boston       2     red
91          91   New York    Boston       2  yellow
92          92    Chicago   Toronto       4   white

[93 rows x 5 columns]

In [15]:
roads2.head()

   Unnamed: 0       from        to  length color
0           0  Vancouver   Calgary       3  gray
1           1  Vancouver   Seattle       1  gray
2           2  Vancouver   Seattle       1  gray
3           3    Seattle  Portland       1  gray
4           4    Seattle  Portland       1  gray

In [16]:
dests2.head()

   Unnamed: 0     from              to  points
0           0   Boston           Miami      12
1           1  Calgary         Phoenix      13
2           2  Calgary  Salt Lake City       7
3           3  Chicago     New Orleans       7
4           4  Chicago        Santa Fe       9

In [18]:
roads2 = roads2[['from','to','length','color']]
dests2 = dests2[['from','to','points']]

In [19]:
roads2.to_csv('Railroads.csv',index=False)
dests2.to_csv('destinations.csv',index=False)